{
    "memorization":{
        "title": "Lochinvar : ",
        "subTitle": "By Sir Walter Scott",
        "items":[
            {"text": "O young Lochinvar is come out of the west, <br />Through all the wide Border his steed was the best; <br />And save his good broadsword he weapons had none, <br />He rode all unarm&#39;d, and he rode all alone. <br />So faithful in love, and so dauntless in war, <br />There never was knight like the young Lochinvar. "},
            {"text": "He staid not for brake, and he stopp&#39;d not for stone, <br />He swam the Eske river where ford there was none; <br />But ere he alighted at Netherby gate, <br />The bride had consented, the gallant came late: <br />For a laggard in love, and a dastard in war, <br />Was to wed the fair Ellen of brave Lochinvar. "},
            {"text": "So boldly he enter&#39;d the Netherby Hall, <br />Among bride&#39;s-men, and kinsmen, and brothers and all: <br />Then spoke the bride&#39;s father, his hand on his sword, <br />(For the poor craven bridegroom said never a word,) <br /><q>O come ye in peace here, or come ye in war, <br />Or to dance at our bridal, young Lord Lochinvar?</q>"},
            {"text": "<q>I long woo&#39;d your daughter, my suit you denied;— <br />Love swells like the Solway, but ebbs like its tide— <br />And now I am come, with this lost love of mine, <br />To lead but one measure, drink one cup of wine. <br />There are maidens in Scotland more lovely by far, <br />That would gladly be bride to the young Lochinvar.</q>"},
            {"text": "The bride kiss&#39;d the goblet: the knight took it up, <br />He quaff&#39;d off the wine, and he threw down the cup. <br />She look&#39;d down to blush, and she look&#39;d up to sigh, <br />With a smile on her lips and a tear in her eye. <br />He took her soft hand, ere her mother could bar,— <br /><q>Now tread we a measure!</q> said young Lochinvar."},
            {"text": "So stately his form, and so lovely her face, <br />That never a hall such a galliard did grace; <br />While her mother did fret, and her father did fume, <br />And the bridegroom stood dangling his bonnet and plume; <br />And the bride-maidens whisper&#39;d, <q>&#39;twere better by far <br />To have match&#39;d our fair cousin with young Lochinvar.</q>"},
            {"text": "One touch to her hand, and one word in her ear, <br />When they reach&#39;d the hall-door, and the charger stood near; <br />So light to the croupe the fair lady he swung, <br />So light to the saddle before her he sprung! <br /><q>She is won! we are gone, over bank, bush, and scaur; <br />They&#39;ll have fleet steeds that follow,</q> quoth young Lochinvar."},
            {"text": "There was mounting &#39;mong Graemes of the Netherby clan; <br />Forsters, Fenwicks, and Musgraves, they rode and they ran: <br />There was racing and chasing on Cannobie Lee, <br />But the lost bride of Netherby ne&#39;er did they see. <br />So daring in love, and so dauntless in war, <br />Have ye e&#39;er heard of gallant like young Lochinvar?"}
        ]
    }
}