{
    "memorization":{
        "title": "Old Testament",
        "subTitle": "LDS Scripture Mastery",
        "items":[
            {"name": "Moses 1:39", "text": "For behold, this is my work and my glory — to bring to pass the immortality and eternal life of man."},
            {"name": "Moses 7:18", "text": "And the Lord called his people ZION, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them."},
            {"name": "Abraham 3:22-23", "text": "Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones;<br/><br/>And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born."},
            {"name": "Genesis 1:26-27", "text": "And God said, Let us make man in our image, after our likeness: and let them have dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.<br/><br/>So God created man in his own image, in the image of God created he him; male and female created he them."},
            {"name": "Genesis 39:9", "text": "There is none greater in this house than I; neither hath he kept back any thing from me but thee, because thou art his wife: how then can I do this great wickedness, and sin against God?"},
            {"name": "Exodus 20:3-17", "text": "Thou shalt have no other gods before me.<br/><br/>Thou shalt not make unto thee any graven image, or any likeness of any thing that is in heaven above, or that is in the earth beneath, or that is in the water under the earth:<br/><br/>Thou shalt not bow down thyself to them, nor serve them: for I the LORD thy God am a jealous God, visiting the iniquity of the fathers upon the children unto the third and fourth generation of them that hate me;<br/><br/>And shewing mercy unto thousands of them that love me, and keep my commandments.<br/><br/>Thou shalt not take the name of the LORD thy God in vain; for the LORD will not hold him guiltless that taketh his name in vain.<br/><br/>Remember the sabbath day, to keep it holy.<br/><br/>Six days shalt thou labour, and do all thy work:<br/><br/>But the seventh day is the sabbath of the LORD thy God: in it thou shalt not do any work, thou, nor thy son, nor thy daughter, thy manservant, nor thy maidservant, nor thy cattle, nor thy stranger that is within thy gates:<br/><br/>For in six days the LORD made heaven and earth, the sea, and all that in them is, and rested the seventh day: wherefore the LORD blessed the sabbath day, and hallowed it.<br/><br/>Honour thy father and thy mother: that thy days may be long upon the land which the LORD thy God giveth thee.<br/><br/>Thou shalt not kill.<br/><br/>Thou shalt not commit adultery.<br/><br/>Thou shalt not steal.<br/><br/>Thou shalt not bear false witness against thy neighbour.<br/><br/>Thou shalt not covet thy neighbour's house, thou shalt not covet thy neighbour's wife, nor his manservant, nor his maidservant, nor his ox, nor his ass, nor any thing that is thy neighbour’s."},
            {"name": "Exodus 33:11", "text": "And the Lord spake unto Moses face to face, as a man speaketh unto his friend. And he turned again into the camp: but his servant Joshua, the son of Nun, a young man, departed not out of the tabernacle. "},
            {"name": "Leviticus 19:18", "text": "Thou shalt not avenge, nor bear any grudge against the children of thy people, but thou shalt love thy neighbour as thyself: I am the LORD."},
            {"name": "Deuteronomy 7:3-4", "text": "Neither shalt thou make marriages with them; thy daughter thou shalt not give unto his son, nor his daughter shalt thou take unto thy son.<br/><br/>For they will turn away thy son from following me, that they may serve other gods: so will the anger of the LORD be kindled against you, and destroy thee suddenly."},
            {"name": "Joshua 1:8", "text": "This book of the law shall not depart out of thy mouth; but thou shalt meditate therein day and night, that thou mayest observe to do according to all that is written therein: for then thou shalt make thy way prosperous, and then thou shalt have good success."},
            {"name": "Joshua 24:15", "text": "And if it seem evil unto you to serve the LORD, choose you this day whom ye will serve; whether the gods which your fathers served that were on the other side of the flood, or the gods of the Amorites, in whose land ye dwell: but as for me and my house, we will serve the LORD."},
            {"name": "1 Samuel 16:7", "text": "But the LORD said unto Samuel, Look not on his countenance, or on the height of his stature; because I have refused him: for the LORD seeth not as man seeth; for man looketh on the outward appearance, but the LORD looketh on the heart."},
            {"name": "Job 19:25-26", "text": "For I know that my redeemer liveth, and that he shall stand at the latter day upon the earth:<br/><br/>And though after my skin worms destroy this body, yet in my flesh shall I see God:"},
            {"name": "Psalms 24:3-4", "text": "Who shall ascend into the hill of the LORD? or who shall stand in his holy place?<br/><br/>He that hath clean hands, and a pure heart; who hath not lifted up his soul unto vanity, nor sworn deceitfully."},
            {"name": "Proverbs 3:5-6", "text": "Trust in the LORD with all thine heart; and lean not unto thine own understanding.<br/><br/>In all thy ways acknowledge him, and he shall direct thy paths."},
            {"name": "Isaiah 1:18", "text": "Come now, and let us reason together, saith the LORD: though your sins be as scarlet, they shall be as white as snow; though they be red like crimson, they shall be as wool."},
            {"name": "Isaiah 29:13-14", "text": "Wherefore the Lord said, Forasmuch as this people draw near me with their mouth, and with their lips do honour me, but have removed their heart far from me, and their fear toward me is taught by the precept of men:<br/><br/>Therefore, behold, I will proceed to do a marvellous work among this people, even a marvellous work and a wonder: for the wisdom of their wise men shall perish, and the understanding of their prudent men shall be hid."},
            {"name": "Isaiah 53:3-5", "text": "He is despised and rejected of men; a man of sorrows, and acquainted with grief: and we hid as it were our faces from him; he was despised, and we esteemed him not.<br/><br/>Surely he hath borne our griefs, and carried our sorrows: yet we did esteem him stricken, smitten of God, and afflicted.<br/><br/>But he was wounded for our transgressions, he was bruised for our iniquities: the chastisement of our peace was upon him; and with his stripes we are healed."},
            {"name": "Isaiah 55:8-9", "text": "For my thoughts are not your thoughts, neither are your ways my ways, saith the LORD.<br/><br/>For as the heavens are higher than the earth, so are my ways higher than your ways, and my thoughts than your thoughts."},
            {"name": "Jeremiah 16:16", "text": "Behold, I will send for many fishers, saith the LORD, and they shall fish them; and after will I send for many hunters, and they shall hunt them from every mountain, and from every hill, and out of the holes of the rocks."},
            {"name": "Ezekiel 37:15-17", "text": "The word of the LORD came again unto me, saying,<br/><br/>Moreover, thou son of man, take thee one stick, and write upon it, For Judah, and for the children of Israel his companions: then take another stick, and write upon it, For Joseph, the stick of Ephraim, and for all the house of Israel his companions:<br/><br/>And join them one to another into one stick; and they shall become one in thine hand."},
            {"name": "Daniel 2:44-45", "text": "And in the days of these kings shall the God of heaven set up a kingdom, which shall never be destroyed: and the kingdom shall not be left to other people, but it shall break in pieces and consume all these kingdoms, and it shall stand for ever.<br/><br/>Forasmuch as thou sawest that the stone was cut out of the mountain without hands, and that it brake in pieces the iron, the brass, the clay, the silver, and the gold; the great God hath made known to the king what shall come to pass hereafter: and the dream is certain, and the interpretation thereof sure."},
            {"name": "Amos 3:7", "text": "Surely the Lord GOD will do nothing, but he revealeth his secret unto his servants the prophets."},
            {"name": "Malachi 3:8-10", "text": "Will a man rob God? Yet ye have robbed me. But ye say, Wherein have we robbed thee? In tithes and offerings.<br/><br/>Ye are cursed with a curse: for ye have robbed me, even this whole nation.<br/><br/>Bring ye all the tithes into the storehouse, that there may be meat in mine house, and prove me now herewith, saith the LORD of hosts, if I will not open you the windows of heaven, and pour you out a blessing, that there shall not be room enough to receive it."},
            {"name": "Malachi 4:5-6", "text": "Behold, I will send you Elijah the prophet before the coming of the great and dreadful day of the LORD:<br/><br/>And he shall turn the heart of the fathers to the children, and the heart of the children to their fathers, lest I come and smite the earth with a curse."}
        ]
    }
}